package by.http.homW.var2;
//  Дана величина А, выражающая объем информации в байтах. Перевести А в более крупные единицы измерения информации
public class Var2 {
	public static void main(String[] args) {
		byte A = 100;
		short B = A;
		int C = B;
		long D = C;
		System.out.println(D);
	}
}
